# FilterNumericLess Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterNumericLess Class
Members See Also
---
Tests whether numeric values from the document are less than a certain value
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public class FilterNumericLess : FilterNumericRuleEvaluator
```

Visual Basic
---
```text
Public Class FilterNumericLess _
	Inherits FilterNumericRuleEvaluator
```

Visual C++
---
```text
public ref class FilterNumericLess : public FilterNumericRuleEvaluator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..FilterNumericRuleEvaluator Autodesk.Revit.DB..::..FilterNumericLess
# See Also
FilterNumericLess Members
Autodesk.Revit.DB Namespace